In [1]:
import pandas as pd

df = pd.read_csv('Cabo_Polonio_Data.csv')
df.head()

,Hostel Name,Price (USD),Paraguayan Guarani,City Center Distance (km),Rating,Total Reviews
0,Lobo Hostel Bar,12.88,92239.41,1.18,8.9,297
1,Viejo Lobo,11.00,78775.89,1.33,8.8,317
2,Narakan,30.42,217851.16,1.22,8.6,63
3,Hostel El Bunker,20.00,143228.90,1.33,2.0,1